# DBSQLExecuteDelete

## Description
Deletes a resultSetInstance created with 'DBSQLExecute' or 'DBSQLExecuteDSN'

```pascal
PROCEDURE DBSQLExecuteDelete(VAR resultSetInst : LONGINT);
```

```python

def vs.DBSQLExecuteDelete(resultSetInst):
    return resultSetInst
```

## Parameters
|Name|Type|Description|
|---|---|---|
|resultSetInst|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* ODBC